# 2. Create DB and Insert Data

DB를 생성하고 테이블을 만들어 MovieLens 데이터셋 Insert 하기

> Create DB

In [1]:
import pandas as pd
import pymysql

In [ ]:
conn = pymysql.connect(host='127.0.0.1'
                , port=3306
                , user = 'root'
                , password='root1234'
                , charset='utf8'
                )

In [3]:
cursor = conn.cursor()
cursor.execute("CREATE DATABASE movie_pj")

In [4]:
conn.commit()
conn.close()

---

> Create Table

In [ ]:
conn = pymysql.connect(host='127.0.0.1'
                , port=3306
                , user = 'root'
                , password='root1234'
                , db = 'movie_pj'
                , charset='utf8'
                )

In [6]:
create_table_users = """
    create table users (
	user_id int not null primary key,
	age int,
    sex VARCHAR(10),
    occupation VARCHAR(100)
);
"""

In [7]:
create_table_movies= """
    create table movies (
	movie_id int not null primary key,
	title VARCHAR(100),
    release_date VARCHAR(50),
    imdb_url VARCHAR(300),
    all_genres VARCHAR(100)
);
"""

In [8]:
create_table_ratings= """
    create table ratings (
    rating_id int AUTO_INCREMENT primary key not null,
    user_id int not null,
	movie_id int not null,
	rating int,
    FOREIGN KEY (user_id) REFERENCES users (user_id),
    FOREIGN KEY (movie_id) REFERENCES movies (movie_id)
);
"""

# foreign key 참조를 위해 primary key(rating_id)를 새로 생성

In [ ]:
cursor = conn.cursor()

In [10]:
cursor.execute(create_table_users)
cursor.execute(create_table_movies)
cursor.execute(create_table_ratings)

0

In [67]:
cursor.execute(sql)

ProgrammingError: (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near ';)' at line 1")

In [ ]:
users.head()

   user_id  age sex  occupation
0        0   24   M  technician
1        1   53   F       other
2        2   23   M      writer
3        3   24   M  technician
4        4   33   F       other

> Insert Data

In [ ]:
users = pd.read_csv('../data/users.csv')
users.tail()

   user_id  age sex  occupation
0        0   24   M  technician
1        1   53   F       other
2        2   23   M      writer
3        3   24   M  technician
4        4   33   F       other

In [ ]:
int(users['user_id'].tail(1).values)+1

,user_id,movie_id,rating,title,release_date,imdb_url,genre_unknown,Action,Adventure,Animation,...,Mystery,Romance,Sci-Fi,Thriller,War,Western,all_genres,age,sex,occupation
0,195,241,3.0,Kolya (1996),24-Jan-1997,http://us.imdb.com/M/title-exact?Kolya%20(1996),0,0,0,0,...,0,0,0,0,0,0,Comedy,49,M,writer
1,195,256,2.0,Men in Black (1997),04-Jul-1997,http://us.imdb.com/M/title-exact?Men+in+Black+...,0,1,1,0,...,0,0,1,0,0,0,Action-Adventure-Comedy-Sci-Fi,49,M,writer
2,195,110,4.0,"Truth About Cats & Dogs, The (1996)",26-Apr-1996,http://us.imdb.com/M/title-exact?Truth%20About...,0,0,0,0,...,0,1,0,0,0,0,Comedy-Romance,49,M,writer
3,195,24,4.0,"Birdcage, The (1996)",08-Mar-1996,"http://us.imdb.com/M/title-exact?Birdcage,%20T...",0,0,0,0,...,0,0,0,0,0,0,Comedy,49,M,writer
4,195,381,4.0,"Adventures of Priscilla, Queen of the Desert, ...",01-Jan-1994,http://us.imdb.com/M/title-exact?Adventures%20...,0,0,0,0,...,0,0,0,0,0,0,Comedy-Drama,49,M,writer
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
99995,872,312,5.0,Titanic (1997),01-Jan-1997,http://us.imdb.com/M/title-exact?imdb-title-12...,0,1,0,0,...,0,1,0,0,0,0,Action-Drama-Romance,48,F,administrator
99996,872,325,4.0,G.I. Jane (1997),01-Jan-1997,http://us.imdb.com/M/title-exact?G%2EI%2E+Jane...,0,1,0,0,...,0,0,0,0,1,0,Action-Drama-War,48,F,administrator
99997,872,347,3.0,Desperate Measures (1998),30-Jan-1998,http://us.imdb.com/Title?Desperate+Measures+(1...,0,0,0,0,...,0,0,0,1,0,0,Crime-Drama-Thriller,48,F,administrator
99998,872,357,2.0,Spawn (1997),01-Aug-1997,http://us.imdb.com/M/title-exact?Spawn+(1997/I),0,1,1,0,...,0,0,1,1,0,0,Action-Adventure-Sci-Fi-Thriller,48,F,administrator
99999,872,341,4.0,"Man Who Knew Too Little, The (1997)",01-Jan-1997,http://us.imdb.com/M/title-exact?Man+Who+Knew+...,0,0,0,0,...,1,0,0,0,0,0,Comedy-Mystery,48,F,administrator

In [76]:
cursor.execute(sql)

1

In [ ]:
movies = pd.read_csv('../data/movies.csv')
movies.head(2)

,movie_id,title,release_date,imdb_url,all_genres
0,0,Toy Story (1995),01-Jan-1995,http://us.imdb.com/M/title-exact?Toy%20Story%2...,Animation-Children-Comedy
1,1,GoldenEye (1995),01-Jan-1995,http://us.imdb.com/M/title-exact?GoldenEye%20(...,Action-Adventure-Thriller

In [14]:
# insert movies table
for i in range(len(movies)):
    cursor.execute(f'INSERT INTO movies (movie_id, title, release_date, imdb_url, all_genres) VALUES \
                ({movies["movie_id"][i]}, "{movies["title"][i]}", "{movies["release_date"][i]}", "{movies["imdb_url"][i]}", "{movies["all_genres"][i]}");')

In [17]:
ratings = pd.read_csv('../data/ratings.csv')
ratings.head(2)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 3 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   user_id   100000 non-null  int64
 1   movie_id  100000 non-null  int64
 2   rating    100000 non-null  float64
dtypes: float64(1), int64(2)
memory usage: 2.3 MB

In [16]:
# insert ratings table
for i in range(len(ratings)):
    cursor.execute(f"INSERT INTO ratings (user_id, movie_id, rating) VALUES \
                ({ratings['user_id'][i]}, {ratings['movie_id'][i]}, {ratings['rating'][i]});")

In [ ]:
conn.commit()
conn.close()

---